УНФ_ТЕСТ.BizOn_WMS_MES/src/InformationRegisters/БЗ_MES_Параметры/БЗ_MES_Параметры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БЗ_MES_Параметры</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Параметр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ.BizOn_WMS_MES/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="cd8ae33f-71f7-45f5-8c7f-ded1811b3261">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="2d67f57b-a1a2-4c4f-a38a-c0d00b01a3dd">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="08c2ea59-4a3c-4ee3-93cf-cd78102315ac">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aee0c019-8d03-4828-b090-1db97f5b99b6">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="9d2afce8-6f7f-464d-9edd-b3fbe8a1e727">
    <name>Партия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1093a0cf-0791-4d50-876c-2e0495a488aa">
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ.BizOn_WMS_MES/src/AccumulationRegisters/БЗ_ОстаткиНазначений/БЗ_ОстаткиНазначений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>БЗ_ОстаткиНазначений</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.БЗ_Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УНФ_ТЕСТ.BizOn_WMS_MES/src/Documents/СборкаЗапасов/СборкаЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="c72244b0-b8b3-463a-867c-026ff64973b4">
  <name>СборкаЗапасов</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.БЗ_ОстаткиНазначений</registerRecords>
  <attributes extendedConfigurationObject="6f06b2e1-8789-41a5-a686-d76a526aae8a">
    <name>СтруктурнаяЕдиницаОтходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f07c1b86-bb22-4552-b466-2dc720b3b748">
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="32aa25c7-4cb5-4a80-9254-c45d0a39dc54">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5195f478-7dcd-4774-b72c-c9f6817cf5dc">
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b769c35c-f717-469e-a69e-ca26edc69cc7">
    <name>ЗаказНаПроизводство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a9d37143-bb2d-4ff5-9e7b-f84cdb6a58ad">
    <name>ЗаказПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7f80d19-40d0-4d37-bbfc-d226b8467b2f">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="20048a6b-9946-41dd-96a9-ea6ccf84050a">
    <name>СтруктурнаяЕдиницаПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="921979ee-3dc5-4f8d-bd04-3adee302b06f">
    <name>ЯчейкаПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b5726b0f-b26f-40ee-9f25-fed6c68340ab">
    <name>СтруктурнаяЕдиницаЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f440d6d4-fb07-4a1d-8e8e-65860b28be43">
    <name>ЯчейкаЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="405f9495-838b-4821-985f-86f453780b45">
    <name>ЯчейкаОтходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8076fbbf-21d6-4fcf-afd1-ec992a755ecd">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63679eca-42c0-4001-a240-1d26f5de713d">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d542e2aa-0045-415e-86fe-28c2899e03b7">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="48518634-751f-40a7-bb6a-000e5cf6c509">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="80a7a3bc-3e3a-4302-a11f-1b344550f8f5">
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="123c0f30-a984-4962-9a77-775f0bdfcfb9">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="09a05f61-231f-431d-add7-3242d26b2c7b">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89ecdb31-99ae-474c-9aae-87c3d9df3678">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e9041e1a-6102-4986-91a8-e701f2a4dfd0">
      <name>Спецификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c335bd7-f36d-4122-909c-d4271c69e8d1">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4311e117-aab8-459b-b623-ab00d7f2cd68">
      <name>ЗаказПокупателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2bb4026b-0c4b-40d4-8ec3-b96ee36afb3c">
      <name>Этап</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="465a9b85-18e2-4f78-9934-0cd74e5ae434">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="563ad7b2-14b0-4ea0-a3e1-19ece2bff6c3">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e2c4608e-07dd-4666-9c9b-6933327a8aec">
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2a6eecef-9f5a-4c5e-bdd0-bcb55b836e10">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c92e2d66-12d2-40d2-a437-de2f53c7f998">
      <name>Резерв</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ea6acaa6-b7a7-4726-b094-9a3991be8a40">
      <name>ДоляСтоимости</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="9f59680a-3c34-4132-b0d6-64cbc2797e0b">
      <name>СтруктурнаяЕдиница</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="57880637-feeb-4e94-b50b-4e1efa1cd5b9">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="09a49c75-8b8b-4080-9c11-b1d182eda8d6">
    <name>Продукция</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a03695ad-06d6-4b29-b52b-42aae67c54b9">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e4db7ec6-f130-4937-a0bb-e2c4fac38c48">
      <name>СтранаПроисхождения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3facefd0-291d-435d-93d8-59d88efcf8ca">
      <name>Резерв</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3f9e4008-1dfa-425e-a1b3-acb842ad7f78">
      <name>Спецификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c88b808-4586-4ad4-9749-cb976cecad36">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b858ff83-a185-4948-8076-116e5da6e2a0">
      <name>ПодразделениеЗавершающегоЭтапа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="036c2a03-2d8c-4a4a-88a4-170f4afd10c2">
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5554022b-a2c2-4fd7-b226-854caf147375">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="77b01aee-ef1a-45c9-bdd3-1dee9bd32569">
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f0c8c514-e5bc-461c-8e13-945606b74a97">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f116128c-ccb8-4c32-98f0-18eadd1f7242">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="33dcda55-f805-4c7d-9ba1-2deb3daac7e4">
      <name>ЗаказПокупателя</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="810fce2c-f7a5-4d7a-9452-c74c19f9a369">
      <name>СтруктурнаяЕдиница</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c0165a45-1141-4ea3-afe4-99e8526f4454">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>БЗ_Назначение</name>
      <type>
        <types>CatalogRef.БЗ_Назначения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="00416d81-4add-4f8c-8f03-6cd3b21a1d8b">
    <name>Отходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="34246dad-442d-4718-84eb-8c540513e666">
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="23c2b455-c513-472f-8b9c-088a6b0aa470">
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6800635d-aa70-4bbe-99d1-a69b0c455aaa">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="085c7d1d-0d3a-4f0f-9163-d595af3fcce6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e074f7be-c1c3-48da-ab65-708e07465e9c">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8813485f-8837-4104-951d-10d2a12ca933">
    <name>РаспределениеЗапасов</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ.BizOn_WMS_MES/src/CommonModules/БЗ_MES_Обмен/Module.bsl
Функция Лог(Событие,Уровень, Данные,Комментарий="") Экспорт
	// Для замера производительности расчета
	ЗаписьЖурналаРегистрации(Событие,Уровень,,Данные,Комментарий,РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
КонецФункции

Функция ПолучитьПараметр(УзелОбъект = Неопределено, Параметр) Экспорт
	КодПараметра = СокрЛП(УзелОбъект.Код)+" | "+Параметр;
	Возврат РегистрыСведений.БЗ_MES_Параметры.Получить(Новый Структура("Параметр",КодПараметра));
КонецФункции

Процедура ЗаписатьПараметр(УзелОбъект = Неопределено, Параметр, Значение) Экспорт
	Если УзелОбъект <> Неопределено Тогда
		КодПараметра = СокрЛП(УзелОбъект.Код)+" | ";
	Иначе
		КодПараметра = "";
	КонецЕсли;
	МПараметр=РегистрыСведений.БЗ_MES_Параметры.СоздатьМенеджерЗаписи();
	МПараметр.Параметр=КодПараметра+Параметр;
	МПараметр.Значение=Значение;
	МПараметр.Записать(Истина);
КонецПроцедуры

// ---- Экспорт ----

Функция Экспорт_Номенклатура(УзелОбъект)
	Запрос=Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура.Изменения ГДЕ Узел=&Узел");	
	Запрос.Параметры.Вставить("Узел",УзелОбъект.Ссылка);
	ОбменНоменклатура=Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой); // Таблица регистраций на узле
	Запрос=Новый Запрос("ВЫБРАТЬ Ссылка.Владелец КАК Владелец,Ссылка ИЗ Справочник.ХарактеристикиНоменклатуры.Изменения ГДЕ Узел=&Узел");
	Запрос.Параметры.Вставить("Узел",УзелОбъект.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока Выборка.Следующий() Цикл
		Если ОбменНоменклатура.Найти(Выборка.Владелец,"Ссылка")=Неопределено Тогда   
			Попытка
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбъект.Ссылка,Выборка.Владелец);
		Исключение   
				Лог("Ошибка регистрации на обмен", УровеньЖурналаРегистрации.Ошибка, Выборка.Владелец);
			КонецПопытки;
		КонецЕсли;
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
	КонецЦикла;	
	Запрос=Новый Запрос("ВЫБРАТЬ Ссылка.Владелец КАК Владелец,Ссылка ИЗ Справочник.ЕдиницыИзмерения.Изменения ГДЕ Узел=&Узел");
	Запрос.Параметры.Вставить("Узел",УзелОбъект.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока Выборка.Следующий() Цикл
		Если ОбменНоменклатура.Найти(Выборка.Владелец,"Ссылка")=Неопределено Тогда
			Если ТипЗнч(Выборка.Владелец()) = Тип("СправочникСсылка.Номенклатура") Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(УзелОбъект.Ссылка,Выборка.Владелец);
			Иначе
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
			КонецЕсли;
		КонецЕсли;
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
	КонецЦикла;
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ШтрихкодыНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ШтрихкодыНоменклатуры.Номенклатура КАК Владелец
	                    |ИЗ
	                    |	РегистрСведений.ШтрихкодыНоменклатуры.Изменения КАК ШтрихкодыНоменклатурыИзменения
	                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	                    |		ПО ШтрихкодыНоменклатурыИзменения.Штрихкод = ШтрихкодыНоменклатуры.Штрихкод
	                    |ГДЕ
	                    |	ШтрихкодыНоменклатурыИзменения.Узел = &Узел
	                    |
	                    |СГРУППИРОВАТЬ ПО
	                    |	ШтрихкодыНоменклатуры.Номенклатура");
	Запрос.Параметры.Вставить("Узел",УзелОбъект.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока Выборка.Следующий() Цикл
		Если ОбменНоменклатура.Найти(Выборка.Владелец,"Ссылка")=Неопределено Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбъект.Ссылка,Выборка.Владелец);
		КонецЕсли;
	КонецЦикла;
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	ШтрихкодыНоменклатурыИзменения.Штрихкод КАК Штрихкод,
	|	ШтрихкодыНоменклатурыИзменения.Номенклатура КАК Номенклатура,
	|	ШтрихкодыНоменклатурыИзменения.Характеристика КАК Характеристика,
	|	ШтрихкодыНоменклатурыИзменения.Партия КАК Партия,
	|	ШтрихкодыНоменклатурыИзменения.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры.Изменения КАК ШтрихкодыНоменклатурыИзменения
	|ГДЕ
	|	ШтрихкодыНоменклатурыИзменения.Узел = &Узел");
	Запрос.Параметры.Вставить("Узел",УзелОбъект.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
		Набор.Отбор.Штрихкод.Установить(Выборка.Штрихкод);
		Набор.Отбор.Номенклатура.Установить(Выборка.Номенклатура);
		Набор.Отбор.Характеристика.Установить(Выборка.Характеристика);
		Набор.Отбор.Партия.Установить(Выборка.Партия);
		Набор.Отбор.ЕдиницаИзмерения.Установить(Выборка.ЕдиницаИзмерения);
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Набор);		
	КонецЦикла;	
	ЗафиксироватьТранзакцию();
	Запрос=Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура.Изменения ГДЕ Узел=&Узел");	
	Запрос.Параметры.Вставить("Узел",УзелОбъект.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока Выборка.Следующий() Цикл
		//Если НЕ УзелОбъект.ОбъектОтправлен(Выборка.Ссылка) Тогда
		//	 ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
		//	 Продолжить;
		//КонецЕсли;
		JSONЗапрос=ПланыОбмена.БЗ_MES.Записать_JSON(УзелОбъект.ПолучитьJSON_Номенклатура(Выборка.Ссылка)); 
		СтатусОтвета=УзелОбъект.ВыполнитьОтправкуJSONПакета(JSONЗапрос);
		Если СтатусОтвета="ok" Тогда
			 ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
		ИначеЕсли СтатусОтвета="limit_out" Тогда
			 Возврат Ложь;
		КонецЕсли;
		JSONЗапрос=Неопределено;
	КонецЦикла;	
	Возврат Истина;
КонецФункции

Функция Экспорт_Справочник(УзелОбъект,Справочник,ТолькоВыгруженные=Ложь)
	Запрос=Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник."+Справочник+".Изменения ГДЕ Узел=&Узел");	
	Запрос.Параметры.Вставить("Узел",УзелОбъект.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.ПолучитьОбъект()=Неопределено Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		Если ТолькоВыгруженные Тогда
			Если НЕ УзелОбъект.ОбъектОтправлен(Выборка.Ссылка) Тогда
				 ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
				 Продолжить;
			КонецЕсли;
		КонецЕсли;
		Ответ="";
		JSONПакет=Новый Структура();
		Если Выборка.Ссылка.ЭтоГруппа Тогда
			JSONПакет.Вставить("Тип",Справочник+"_Группа");			
		Иначе
			JSONПакет.Вставить("Тип",Справочник);
		КонецЕсли;
		Выполнить("JSONПакет.Вставить(""Объект"",УзелОбъект.Получить_"+Справочник+"(Выборка.Ссылка))");
		JSONЗапрос=ПланыОбмена.БЗ_MES.Записать_JSON(JSONПакет);
		JSONПакет=Неопределено;
		СтатусОтвета=УзелОбъект.ВыполнитьОтправкуJSONПакета(JSONЗапрос,Ответ);
		JSONЗапрос=Неопределено;
		Если СтатусОтвета="ok" Тогда
			 ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
		ИначеЕсли СтатусОтвета="need_objects" Тогда
			 Если НЕ ОтправитьНенайденыеОбъекты(УзелОбъект, Ответ.НенайденыОбъекты) Тогда
				 Возврат Ложь;
			 КонецЕсли;			 
			 СтатусОтвета=УзелОбъект.ВыполнитьОтправкуJSONПакета(JSONЗапрос,Ответ);
			 Если СтатусОтвета="ok" Тогда
				 ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
			 ИначеЕсли СтатусОтвета="limit_out" Тогда
				 Возврат Ложь;				 
			 КонецЕсли;
		ИначеЕсли СтатусОтвета="limit_out" Тогда
			 Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

Функция Экспорт_Документ(УзелОбъект,Документ,ТолькоВыгруженные=Ложь)
	Запрос=Новый Запрос("ВЫБРАТЬ "+Документ+".Ссылка ИЗ Документ."+Документ+".Изменения КАК "+Документ+" ГДЕ Узел=&Узел УПОРЯДОЧИТЬ ПО "+Документ+".Ссылка.Дата");
	Запрос.Параметры.Вставить("Узел",УзелОбъект.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.ПолучитьОбъект()=Неопределено Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
			Продолжить;
		КонецЕсли;
		Если ТолькоВыгруженные Тогда
			Если НЕ УзелОбъект.ОбъектОтправлен(Выборка.Ссылка) Тогда
				 ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
				 Продолжить;
			КонецЕсли;
		КонецЕсли;		
		Ответ="";
		JSONПакет=Новый Структура();
		JSONПакет.Вставить("Тип",Документ);
		Выполнить("JSONПакет.Вставить(""Объект"",УзелОбъект.Получить_"+Документ+"(Выборка.Ссылка))");
		JSONЗапрос=ПланыОбмена.БЗ_MES.Записать_JSON(JSONПакет);
		JSONПакет=Неопределено;
		СтатусОтвета=УзелОбъект.ВыполнитьОтправкуJSONПакета(JSONЗапрос,Ответ);
		JSONЗапрос=Неопределено;
		Если СтатусОтвета="ok" Тогда
			 ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
		ИначеЕсли СтатусОтвета="need_objects" Тогда
			 Если НЕ ОтправитьНенайденыеОбъекты(УзелОбъект, Ответ.НенайденыОбъекты) Тогда
				 Возврат Ложь;
			 КонецЕсли;			 
			 СтатусОтвета=УзелОбъект.ВыполнитьОтправкуJSONПакета(JSONЗапрос,Ответ);
			 Если СтатусОтвета="ok" Тогда
				 ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,Выборка.Ссылка);
			 ИначеЕсли СтатусОтвета="limit_out" Тогда
				 Возврат Ложь;				 
			 КонецЕсли;
		ИначеЕсли СтатусОтвета="limit_out" Тогда
			 Возврат Ложь;			 
		КонецЕсли;
	КонецЦикла;	
	Возврат Истина;
КонецФункции

Процедура Экспорт_ТоварыВПроизводстве(УзелОбъект)
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Документ.СборкаЗапасов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки = Блокировка.Добавить("Документ.БЗ_ОПС");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	Запрос=Новый Запрос();
	Запрос.Текст="ВЫБРАТЬ
	|	ОстаткиПроизводства.Номенклатура КАК Номенклатура,
	|	ОстаткиПроизводства.Характеристика КАК Характеристика,
	|	ОстаткиПроизводства.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|	ОстаткиПроизводства.Назначение КАК Назначение,
	|	СУММА(ОстаткиПроизводства.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗаказыНаПроизводство.Номенклатура КАК Номенклатура,
	|		ЗаказыНаПроизводство.Характеристика КАК Характеристика,
	|		ЗаказыНаПроизводство.ЗаказНаПроизводство КАК ЗаказНаПроизводство,
	|		ЗаказыНаПроизводство.КоличествоОстаток КАК Количество,
	|		ЗаказыНаПроизводство.Назначение КАК Назначение
	|	ИЗ
	|		РегистрНакопления.БЗ_ОстаткиНазначений.Остатки(
	|				,
	|				ЗаказНаПроизводство.Дата > &ДатаВидимости
	|					И ЗаказНаПроизводство.Проведен = ИСТИНА) КАК ЗаказыНаПроизводство
	|	ГДЕ
	|		ЗаказыНаПроизводство.Номенклатура.Изготовитель <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗаказыНаПроизводство.Номенклатура,
	|		ЗаказыНаПроизводство.Характеристика,
	|		ЗаказыНаПроизводство.ЗаказНаПроизводство,
	|		ЗаказыНаПроизводство.Количество,
	|		ЗаказыНаПроизводство.Назначение
	|	ИЗ
	|		Документ.БЗ_ОПС КАК БЗ_ОПС
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.БЗ_ОПС.ПриемкиТоваров КАК БЗ_ОПСПриемкиТоваров
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БЗ_ОстаткиНазначений КАК ЗаказыНаПроизводство
	|				ПО БЗ_ОПСПриемкиТоваров.ПриемкаТоваров = ЗаказыНаПроизводство.Регистратор
	|			ПО БЗ_ОПС.Ссылка = БЗ_ОПСПриемкиТоваров.Ссылка
	|	ГДЕ
	|		НЕ БЗ_ОПС.ПринятоНаСкладе
	|		И НЕ ЗаказыНаПроизводство.Номенклатура ЕСТЬ NULL) КАК ОстаткиПроизводства
	|ГДЕ
	|	ОстаткиПроизводства.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПроизводства.Номенклатура,
	|	ОстаткиПроизводства.Характеристика,
	|	ОстаткиПроизводства.ЗаказНаПроизводство,
	|	ОстаткиПроизводства.Назначение";
	Запрос.УстановитьПараметр("ДатаВидимости", НачалоДня(ТекущаяДата())-60*60*24*240); // 240 дней	
	ВыборкаОстатки=Запрос.Выполнить().Выбрать();
	ПолученыНаСкладеОПС=Новый Массив();
	ОтправленыеОПС=Новый Массив();
	Запрос=Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БЗ_ОПС.Ссылка,
	|	БЗ_ОПС.Ссылка.ПринятоНаСкладе КАК ПринятоНаСкладе,
	|	БЗ_ОПС.Ссылка.GUID КАК GUID
	|ИЗ
	|	Документ.БЗ_ОПС.Изменения КАК БЗ_ОПС
	|ГДЕ
	|	БЗ_ОПС.Узел = &Узел";
	Запрос.УстановитьПараметр("Узел",УзелОбъект.Ссылка);
	ВыборкаОПС=Запрос.Выполнить().Выбрать();
	Пока ВыборкаОПС.Следующий() Цикл
		Попытка
			Если ВыборкаОПС.ПринятоНаСкладе Тогда
				ПолученыНаСкладеОПС.Добавить(ВыборкаОПС.GUID);
				ОтправленыеОПС.Добавить(ВыборкаОПС.Ссылка);
			КонецЕсли;
		Исключение
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,ВыборкаОПС.Ссылка);
		КонецПопытки;
	КонецЦикла;	
	ЗафиксироватьТранзакцию();
	Остатки=Новый Массив();
	Пока ВыборкаОстатки.Следующий() Цикл
		Остатки.Добавить(
			Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЗаказНаПроизводство, Назначение, Количество",
			УзелОбъект.СсылкаНаОбъект(ВыборкаОстатки.Номенклатура),
			УзелОбъект.СсылкаНаОбъект(ВыборкаОстатки.Характеристика),
			УзелОбъект.СсылкаНаОбъект(ВыборкаОстатки.ЗаказНаПроизводство),
			УзелОбъект.СсылкаНаОбъект(ВыборкаОстатки.Назначение),
			ВыборкаОстатки.Количество));
	КонецЦикла;	
	JSONПакет=Новый Структура();
	JSONПакет.Вставить("Тип","ТоварыВПроизводстве");
	JSONПакет.Вставить("Остатки",Остатки);
	JSONПакет.Вставить("ПолученыНаСкладеОПС",ПолученыНаСкладеОПС);
	JSONЗапрос=ПланыОбмена.БЗ_MES.Записать_JSON(JSONПакет);
	Ответ="";
	СтатусОтвета=УзелОбъект.ВыполнитьОтправкуJSONПакета(JSONЗапрос,Ответ);
	Если СтатусОтвета="need_objects" Тогда
		Если НЕ ОтправитьНенайденыеОбъекты(УзелОбъект, Ответ.НенайденыОбъекты) Тогда
			Возврат;
		Иначе
			СтатусОтвета=УзелОбъект.ВыполнитьОтправкуJSONПакета(JSONЗапрос,Ответ);
		КонецЕсли;		
	КонецЕсли;
	Если СтатусОтвета="ok" Тогда
		Для Каждого ОПС Из ОтправленыеОПС Цикл
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбъект.Ссылка,ОПС);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ОтправитьНенайденыеОбъекты(УзелОбъект, СписокОбъектов, Знач Уровень=1)
	Для Каждого Объект Из СписокОбъектов Цикл		
		Тип=Объект.Тип;
		Если Тип="Подразделения" Тогда
			Ссылка=Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(Новый УникальныйИдентификатор(Объект.GUID)).ПолучитьОбъект().Ссылка;
			Если Ссылка.ЭтоГруппа Тогда	Тип=Объект.Тип+"_Группа"; КонецЕсли;
		ИначеЕсли Тип="Склады" Тогда
			Ссылка=Справочники.СтруктурныеЕдиницы.ПолучитьСсылку(Новый УникальныйИдентификатор(Объект.GUID)).ПолучитьОбъект().Ссылка;
			Если Ссылка.ЭтоГруппа Тогда	Тип=Объект.Тип+"_Группа"; КонецЕсли;
		Иначе			
			Попытка
				Ссылка=Справочники[Объект.Тип].ПолучитьСсылку(Новый УникальныйИдентификатор(Объект.GUID)).ПолучитьОбъект().Ссылка;
				Если Ссылка.ЭтоГруппа Тогда
					Тип=Объект.Тип+"_Группа";
				КонецЕсли;			
			Исключение
				Попытка
					Ссылка=Документы[Объект.Тип].ПолучитьСсылку(Новый УникальныйИдентификатор(Объект.GUID)).ПолучитьОбъект().Ссылка;
				Исключение
					Продолжить;
				КонецПопытки;
			КонецПопытки;
		КонецЕсли;
		Если ТипЗнч(Ссылка)=Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда
			Ссылка=Ссылка.Владелец;
			Объект.Тип="Номенклатура";
			Тип="Номенклатура";
		ИначеЕсли ТипЗнч(Ссылка)=Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
			Ссылка=Ссылка.Владелец;
			Объект.Тип="Номенклатура";
			Тип="Номенклатура";
		КонецЕсли;		
		Ответ="";
		JSONПакет=Новый Структура();
		JSONПакет.Вставить("Тип",Тип);
		Выполнить("JSONПакет.Вставить(""Объект"",УзелОбъект.Получить_"+Объект.Тип+"(Ссылка))");
		JSONЗапрос=ПланыОбмена.БЗ_MES.Записать_JSON(JSONПакет);
		СтатусОтвета=УзелОбъект.ВыполнитьОтправкуJSONПакета(JSONЗапрос,Ответ);
		Если СтатусОтвета="need_objects" Тогда
			 Если Уровень=5 Тогда Возврат Истина; КонецЕсли; // На случай рекурсионной зацикленности
			 Если НЕ ОтправитьНенайденыеОбъекты(УзелОбъект, Ответ.НенайденыОбъекты, Уровень+1) Тогда
				 Возврат Ложь;
			 КонецЕсли;
			 СтатусОтвета=УзелОбъект.ВыполнитьОтправкуJSONПакета(JSONЗапрос,Ответ);
		ИначеЕсли СтатусОтвета="limit_out" Тогда
			 Возврат Ложь;			 
		КонецЕсли;			
	КонецЦикла;
	Возврат Истина;
КонецФункции

// ---- Импорт ----

Процедура Импорт_БЗ_ОПС(УзелОбъект)
	КоличествоОбъектов=3;
	Пока КоличествоОбъектов=3 Цикл
		ПринятыеОбъекты=Новый Массив();
		Ответ="";	
		JSONПакет=Новый Структура();
		JSONПакет.Вставить("Тип","Экспорт_БЗ_ОПС");
		JSONЗапрос=ПланыОбмена.БЗ_MES.Записать_JSON(JSONПакет);		
		СтатусОтвета=УзелОбъект.ВыполнитьОтправкуJSONПакета(JSONЗапрос,Ответ);
		Если СтатусОтвета="ok" Тогда
			КоличествоОбъектов=Ответ.Объекты.Количество();			
			Для Каждого Данные Из Ответ.Объекты Цикл
				Если ЗначениеЗаполнено(УзелОбъект.НайтиСоздатьБЗ_ОПС(Данные))Тогда
					ПринятыеОбъекты.Добавить(Данные.GUID);
				КонецЕсли;
			КонецЦикла;
			Для Каждого GUID Из Ответ.НепринятыеОПС Цикл
				Запрос=Новый Запрос("ВЫБРАТЬ
				                    |	БЗ_ОПС.Ссылка,
				                    |	БЗ_ОПС.ПринятоНаСкладе
				                    |ИЗ
				                    |	Документ.БЗ_ОПС КАК БЗ_ОПС
				                    |ГДЕ
				                    |	БЗ_ОПС.УзелОбмена = &УзелОбмена
				                    |	И БЗ_ОПС.GUID = &GUID");
				Запрос.УстановитьПараметр("УзелОбмена",УзелОбъект.Ссылка);
				Запрос.УстановитьПараметр("GUID",GUID);
				Выборка=Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Если Выборка.ПринятоНаСкладе Тогда
						ПланыОбмена.ЗарегистрироватьИзменения(УзелОбъект.Ссылка,Выборка.Ссылка);
						ЗаписатьПараметр(УзелОбъект,"Обмен_45_ТоварыВПроизводстве", ТекущаяДата()-1200);
					Иначе
						Запрос=Новый Запрос();
						Запрос.Текст =
						"ВЫБРАТЬ
						|	План.НомерПаллеты
						|ИЗ
						|	(ВЫБРАТЬ
						|		ТСД_ВводДанных.НомерПаллеты КАК НомерПаллеты
						|	ИЗ
						|		Документ.БЗ_ОПС.ТСД_ВводДанных КАК ТСД_ВводДанных
						|	ГДЕ
						|		ТСД_ВводДанных.Ссылка = &Ссылка
						|	
						|	СГРУППИРОВАТЬ ПО
						|		ТСД_ВводДанных.НомерПаллеты) КАК План
						|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
						|			ПриемкиТоваров.НомерПаллеты КАК НомерПаллеты
						|		ИЗ
						|			Документ.БЗ_ОПС.ПриемкиТоваров КАК ПриемкиТоваров
						|		ГДЕ
						|			ПриемкиТоваров.Ссылка = &Ссылка
						|		
						|		СГРУППИРОВАТЬ ПО
						|			ПриемкиТоваров.НомерПаллеты) КАК Факт
						|		ПО План.НомерПаллеты = Факт.НомерПаллеты
						|ГДЕ
						|	Факт.НомерПаллеты ЕСТЬ NULL";
						Запрос.УстановитьПараметр("Ссылка",Выборка.Ссылка);
						Если Запрос.Выполнить().Пустой() Тогда
							ОПС=Выборка.Ссылка.ПолучитьОбъект();
							ОПС.ПринятоНаСкладе=Истина;
							ОПС.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
							ЗаписатьПараметр(УзелОбъект,"Обмен_45_ТоварыВПроизводстве", ТекущаяДата()-1200);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Прервать;
		КонецЕсли;
		Если ПринятыеОбъекты.Количество()>0  Тогда
			JSONПакет=Новый Структура();
			JSONПакет.Вставить("Тип","Принято_БЗ_ОПС");
			JSONПакет.Вставить("ПринятыеОбъекты",ПринятыеОбъекты);
			JSONЗапрос=ПланыОбмена.БЗ_MES.Записать_JSON(JSONПакет);
			СтатусОтвета=УзелОбъект.ВыполнитьОтправкуJSONПакета(JSONЗапрос);
			Если СтатусОтвета<>"ok" Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

// ---- Основные ----

Функция ВыполнитьОбменУзла(УзелОбъект)
// Экспорт ->>>
	ЗаписатьПараметр(УзелОбъект,"Обмен_00_Запуск", ТекущаяДата());

// Справочники
	Если НЕ Экспорт_Номенклатура(УзелОбъект) Тогда Возврат Ложь; КонецЕсли;
	Если НЕ Экспорт_Справочник(УзелОбъект,"БЗ_Участки") Тогда Возврат Ложь; КонецЕсли;
	Если НЕ Экспорт_Справочник(УзелОбъект,"БЗ_РабочиеМеста") Тогда Возврат Ложь; КонецЕсли;
	//Если НЕ Экспорт_Справочник(УзелОбъект,"БЗ_ВариантыНаладки") Тогда Возврат Ложь; КонецЕсли;
	Если НЕ Экспорт_Справочник(УзелОбъект,"БЗ_ТехнологическиеОперации") Тогда Возврат Ложь; КонецЕсли;
	//Если НЕ Экспорт_Справочник(УзелОбъект,"БЗ_ТипыТЕ") Тогда Возврат Ложь; КонецЕсли;
	//Если НЕ Экспорт_Справочник(УзелОбъект,"БЗ_ТипыДвижений_ТСД") Тогда Возврат Ложь; КонецЕсли;
	//Если НЕ Экспорт_Справочник(УзелОбъект,"БЗ_ВидыПартииПроизводства") Тогда Возврат Ложь; КонецЕсли;
	Если НЕ Экспорт_Справочник(УзелОбъект,"БЗ_Сотрудники_ТСД") Тогда Возврат Ложь; КонецЕсли;
	Если НЕ Экспорт_Справочник(УзелОбъект,"БЗ_Принтеры") Тогда Возврат Ложь; КонецЕсли;
	
// Только выгруженные объекты
	Если НЕ Экспорт_Справочник(УзелОбъект,"Организации",Истина) Тогда Возврат Ложь; КонецЕсли;
	//Если НЕ Экспорт_Справочник(УзелОбъект,"Подразделения",Истина) Тогда Возврат Ложь; КонецЕсли;
	Если НЕ Экспорт_Справочник(УзелОбъект,"Пользователи",Истина) Тогда Возврат Ложь; КонецЕсли;
	Если НЕ Экспорт_Справочник(УзелОбъект,"КлассификаторЕдиницИзмерения",Истина) Тогда Возврат Ложь; КонецЕсли;
	//Если НЕ Экспорт_Справочник(УзелОбъект,"ФизическиеЛица",Истина) Тогда Возврат Ложь; КонецЕсли;
	//Если НЕ Экспорт_Справочник(УзелОбъект,"Склады",Истина) Тогда Возврат Ложь; КонецЕсли;
	//Если НЕ Экспорт_Справочник(УзелОбъект,"СтруктурныеЕдиницы",Истина) Тогда Возврат Ложь; КонецЕсли;	
	//Если НЕ Экспорт_Справочник(УзелОбъект,"НоменклатурныеГруппы",Истина) Тогда Возврат Ложь; КонецЕсли;
	
	ДатаЭкспорта=ПолучитьПараметр(УзелОбъект,"Обмен_45_ТоварыВПроизводстве");
	Если ДатаЭкспорта.Значение=Неопределено Тогда
		Экспорт_ТоварыВПроизводстве(УзелОбъект);
		ЗаписатьПараметр(УзелОбъект,"Обмен_45_ТоварыВПроизводстве", ТекущаяДата());
	ИначеЕсли ДатаЭкспорта.Значение<ТекущаяДата()-60*5 Тогда
		Экспорт_ТоварыВПроизводстве(УзелОбъект);
		ЗаписатьПараметр(УзелОбъект,"Обмен_45_ТоварыВПроизводстве", ТекущаяДата());
	КонецЕсли;

	ЗаписатьПараметр(УзелОбъект,"Обмен_49_ЭкспортОкончание", ТекущаяДата());
	
// <<- Импорт
	Импорт_БЗ_ОПС(УзелОбъект);
	ЗаписатьПараметр(УзелОбъект,"Обмен_99_ИмпортОкончание", ТекущаяДата());
	
	Возврат Истина;
КонецФункции

Процедура ВыполнитьОбмен() Экспорт
	ПараметрыСеанса.БЗ_MES_Обмен_Счетчик=0;
	Выборка=ПланыОбмена.БЗ_MES.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Активирован Тогда
			ПараметрыСеанса.БЗ_MES_Обмен_Сессия="";			
			УзелОбъект=Выборка.Ссылка.ПолучитьОбъект();
			Если НЕ ВыполнитьОбменУзла(УзелОбъект) Тогда
				УзелОбъект.ЗавершитьСессию();
				Прервать;
			КонецЕсли;
			УзелОбъект.ЗавершитьСессию();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
